Previous edits and /or wall joins will not be preserved on this operation.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId LostEditsJoinsRedoFaceBased { get; }
  Visual Basic
Public Shared ReadOnly Property LostEditsJoinsRedoFaceBased As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ LostEditsJoinsRedoFaceBased {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures WallFailures Class
  Autodesk.Revit.DB Namespace